import MainLayout from "../../layout/mainLayout";
import React from "react";
import Image from "next/image";
import img from "../../images/banner1.png";

const state = [
    {id: 1, text: ''},
    {
        id: 2,
        text: ' Ремонт авто марки Opel наш сервис выполняет уже более 25 лет. С 1992 г. автосервис "КЛЮЧ-АВТО"\n' +
            '                            ремонтирует авто марок Опель и Шевроле. За годы бесценной практики наши специалисты\n' +
            '                            детально\n' +
            '                            изучили\n' +
            '                            машины данных марок и научились быстро диагностировать любые неполадки.'
    },
    {
        id: 3, text: 'Одна из болячек — это термостат. Когда деталь выходит из строя, вентилятор системы\n' +
            '                            охлаждения\n' +
            '                            начинает\n' +
            '                            вращаться без остановок. Это отображается на панели приборов. Также изнашивается прокладка,\n' +
            '                            приводящая к\n' +
            '                            течи охлаждающей жидкости. Ее также меняют вместе с термостатом во время обслуживания.'
    },
    {
        id: 4, text: ' Для кузовов «J» и «H» характерны поломки автоматической коробки передач, роботизированной\n' +
            '                            КПП и\n' +
            '                            наконечников рулевых тяг. Последние «ходят» не более 30 тыс. км. Ремонт «автомата» чаще\n' +
            '                            всего\n' +
            '                            вызван\n' +
            '                            попаданием охлаждающей жидкости внутрь контура АКПП. Причина — разгерметизация радиатора.'
    },
    {
        id: 5,
        text: '        Другим популярным автомобилем марки Opel является семейный минивэн Зафира. Его болячки\n' +
            '                            главным\n' +
            '                            образом\n' +
            '                            находятся в двигателе и подвеске. Проблемы с коробкой передач тоже случаются, но их причиной\n' +
            '                            является\n' +
            '                            некачественное масло. В дизельных моторах «ахиллесовой пятой» признаны топливные форсунки.\n' +
            '                            Как\n' +
            '                            бензиновые так и дизельные агрегаты Опель Зафира оснащаются ременным приводом ГРМ. Ремень\n' +
            '                            обрывается\n' +
            '                            через 120-130 тыс. км пробега. Поскольку определить его износ визуально нелегко, а обрыв\n' +
            '                            ремня\n' +
            '                            приводит\n' +
            '                            к фатальному повреждению шатунно-поршневой группы, а как результат к дорогостоящему ремонту,\n' +
            '                            необходимо\n' +
            '                            регулярно обращаться на СТО для техобслуживания.'
    },
    {
        id: 6,
        text: '      Компактный хэтчбек Opel Corsa часто заезжает на СТО из-за селектора автоматической коробки\n' +
            '                            передач,\n' +
            '                            печки салона и проводки. Электрика в моторном отсеке не защищена, поэтому после автомойки\n' +
            '                            нередко\n' +
            '                            происходит замыкание. Другой характерной неисправностью авто является заклинивание рычага\n' +
            '                            переключения\n' +
            '                            КПП. Он перестает сдвигаться в положение «P». Ремонт путем замены селектора позволяет решить\n' +
            '                            данную\n' +
            '                            проблему.'
    },
]


const carBrand = () => {
    return (
        <MainLayout title="О марке автомобиля">
            <section className="_vrm">
                <div className="container">
                    <h1>Ремонт OPEL</h1>
                    <div className="grid _vrm">
                        <div className="carBrandImg">
                            <Image
                                fill
                                src={img}
                                alt="banner"
                                placeholder="blur"
                            />
                        </div>
                        <p>
                            Одной из самых популярных моделей у данного производителя является Астра. Автомобиль
                            выпускается с 1991
                            года, активно продается в ряде стран, включая Россию. Astra полюбился многим за низкую
                            стоимость
                            неплохое качество, но как большинсво бюджетных авто, часто заезжает на ремонт.
                        </p>
                    </div>
                    <div className="flex-c">
                        <h2>Типичные неисправности Опеля</h2>
                        {
                            state && state.map(item=>
                                item.text ?
                                    <p key={item.id}>{item.text}</p>
                                    :''
                            )
                        }
                    </div>
                </div>
            </section>
        </MainLayout>
    );
};

export default carBrand;