import React from 'react';
import MainLayot from "../layot/mainLayot";

const About = () => {
    return (
        <MainLayot>
            <div className="container">
                Автосервис «Москва» в сфере ремонта и ТО автомобилей разных марок и моделей работает более 10 лет и пользуется заслуженной репутацией надежного и ответственного партнера, которому можно доверять. К вашим услугам – диагностика неисправностей, плановый и аварийный ремонт, комплексное ТО-1 и ТО-2, восстановление после ДТП под ключ, автотюнинг, установка дополнительного оборудования и многое другое. Взятые на себя обязательства мы выполняем качественно, профессионально и в установленный договором срок. Наши расценки на услуги считаются вполне демократичными. И новые, и постоянные клиенты могут участвовать в акциях и пользоваться скидками.
            </div>
        </MainLayot>
    );
};

export default About;